{
    "certificados":[
        {
            "id": 1,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187517/Captura_de_pantalla_2024-07-16_a_la_s_9.37.08_p.m._aormeb.png",
            "titulo": "Finalizaci贸n de programa",
            "descripcion": "Al completar un curso completo de Front End y React, se adquieren habilidades y logros clave como la creaci贸n de estructuras web y estilos visuales responsivos con HTML y CSS, el manejo avanzado de JavaScript para manipular el DOM y manejar eventos utilizando ES6+, y la capacidad de construir interfaces de usuario din谩micas y reutilizables con componentes de React. Adem谩s, se aprende a gestionar el estado de la aplicaci贸n con Redux o Context API, a consumir APIs y manejar peticiones HTTP, a escribir pruebas unitarias y de integraci贸n, y a utilizar herramientas de desarrollo como Webpack, Babel y herramientas de depuraci贸n. Tambi茅n se aplican buenas pr谩cticas de dise帽o, accesibilidad y optimizaci贸n de rendimiento, esenciales para el desarrollo front-end moderno."
        },
        {
            "id": 2,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187519/Captura_de_pantalla_2024-07-16_a_la_s_9.37.48_p.m._hgt2sm.png",
            "titulo": "React G6",
            "descripcion": "Al completar un curso de React, se adquieren habilidades y logros esenciales como la capacidad de construir interfaces de usuario din谩micas y reutilizables utilizando componentes de React, gestionar el estado de la aplicaci贸n de manera eficiente con Redux o Context API, y consumir APIs para manejar peticiones HTTP. Tambi茅n se aprende a escribir pruebas unitarias y de integraci贸n para asegurar la calidad del c贸digo, utilizar herramientas de desarrollo como Webpack y Babel, y aplicar buenas pr谩cticas de dise帽o, accesibilidad y optimizaci贸n de rendimiento en aplicaciones React."
        },
        {
            "id": 3,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187513/Captura_de_pantalla_2024-07-16_a_la_s_9.35.23_p.m._fi8zp5.png",
            "titulo": "React: Desarrollo con Java Script",
            "descripcion": "隆Estoy muy emocionada de compartir que he completado con 茅xito el curso de React: desarrollando con JavaScript en Alura!  Aprend铆 a describir las ventajas de usar React, implementar componentes reactivos, investigar y analizar mensajes de error, modificar y evolucionar componentes seg煤n las necesidades del proyecto, 隆y hasta prototipar una aplicaci贸n desde cero! "
        },
        {
            "id": 4,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187512/Captura_de_pantalla_2024-07-16_a_la_s_9.34.58_p.m._blpfjx.png",
            "titulo": "Hooks en React JS",
            "descripcion": "Aprend铆 tanto sobre los hooks de ReactJS y su importancia, c贸mo gestionar el estado de un componente con useState, acceder al DOM virtual con useRef, entender el ciclo de vida de un componente con useEffect, implementar estados globales con contextAPI, utilizar useReducer en aplicaciones complejas y construir mis propios hooks."
        },
        {
            "id": 5,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187510/Captura_de_pantalla_2024-07-16_a_la_s_9.36.19_p.m._avzyw1.png",
            "titulo": "Principiante en programaci贸n",
            "descripcion": "Al completar un curso de formaci贸n principiante en programaci贸n, se adquieren habilidades y logros fundamentales como la comprensi贸n de conceptos b谩sicos de l贸gica de programaci贸n, estructuras de control como bucles y condicionales, y el uso de variables y tipos de datos. Adem谩s, se aprende a escribir y depurar programas simples, desarrollar habilidades de resoluci贸n de problemas mediante la aplicaci贸n de algoritmos b谩sicos, y familiarizarse con herramientas de desarrollo y entornos de programaci贸n."
        },
        {
            "id": 6,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187519/Captura_de_pantalla_2024-07-16_a_la_s_9.36.54_p.m._perqsl.png",
            "titulo": "L贸gica de programaci贸n con Java Script",
            "descripcion": " Aprend铆 a mostrar mensajes en pantalla de forma interactiva, a utilizar variables en el desarrollo de software y a seguir buenas pr谩cticas de programaci贸n. Adem谩s, desarroll茅 una aplicaci贸n de principio a fin, inspirada en el mundo real"
        },
        {
            "id": 7,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187520/Captura_de_pantalla_2024-07-16_a_la_s_9.37.18_p.m._j8mgyb.png",
            "titulo": "CSS: Flexbox y Layouts responsivos ",
            "descripcion":"Aprend铆 a utilizar las propiedades de Flexbox en la pr谩ctica, creando un proyecto responsivo y cambiando el eje de los elementos a horizontal o vertical. Tambi茅n aprend铆 a aplicar videos de manera responsiva y a integrar las propiedades de Flexbox con otras propiedades de CSS."
        },
        {
            "id": 9,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187515/Captura_de_pantalla_2024-07-16_a_la_s_9.37.28_p.m._bhxtak.png",
            "titulo": "Git y Github: repositorio, commit y versiones",
            "descripcion": "He aprendido a diferenciar entre Git y GitHub, dominar los comandos principales, controlar las versiones de mis proyectos, crear estrategias de ramificaciones y navegar en el tiempo con el comando git log."
        },
        {
            "id": 10,
            "url": "https://res.cloudinary.com/dujrua0vo/image/upload/v1721187510/Captura_de_pantalla_2024-07-16_a_la_s_9.35.57_p.m._owxfcw.png",
            "titulo": "Front-End G6",
            "descripcion": "Adquir铆 habilidades y logros esenciales como la creaci贸n de estructuras web con HTML, el dise帽o y estilizaci贸n de p谩ginas web mediante CSS, y el uso de JavaScript para a帽adir interactividad. "
        }
    ]
}
